{"class_name": "Model", "config": {"name": "model_10", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 784], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "encoder", "class_name": "Model", "config": {"name": "encoder", "layers": [{"name": "input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 784], "dtype": "float32", "sparse": false, "name": "input"}, "inbound_nodes": []}, {"name": "encoding", "class_name": "Dense", "config": {"name": "encoding", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "mean", "class_name": "Dense", "config": {"name": "mean", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoding", 0, 0, {}]]]}, {"name": "log-variance", "class_name": "Dense", "config": {"name": "log-variance", "trainable": true, "dtype": "float32", "units": 2, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["encoding", 0, 0, {}]]]}, {"name": "lambda_10", "class_name": "Lambda", "config": {"name": "lambda_10", "trainable": true, "dtype": "float32", "function": ["4wEAAAAAAAAABAAAAAUAAABDAAAAczwAAAB8AFwCfQF9AnQAagF0AKACfAGhAWQBGQB0A2YCZAJ0\nBGQDjQN9A3wBdACgBXwCZAQbAKEBfAMUABcAUwApBU7pAAAAAGcAAAAAAAAAACkD2gVzaGFwZdoE\nbWVhbtoGc3RkZGV26QIAAAApBtoBS9oNcmFuZG9tX25vcm1hbHICAAAA2gpsYXRlbnRfZGlt2gtl\ncHNpbG9uX3N0ZNoDZXhwKQTaBGFyZ3PaBnpfbWVhbtoJel9sb2dfdmFy2gdlcHNpbG9uqQByDwAA\nAPU/AAAAQzpcVXNlcnNccnl1Y2hcT25lRHJpdmVc44OH44K544Kv44OI44OD44OXXGRublzlrp/o\nt7VnYW5cVkFFLnB52ghzYW1wbGluZzEAAABzBgAAAAABCAEeAQ==\n", null, null], "function_type": "lambda", "output_shape": [2], "output_shape_type": "raw", "arguments": {}}, "inbound_nodes": [[["mean", 0, 0, {}], ["log-variance", 0, 0, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["mean", 0, 0], ["log-variance", 0, 0], ["lambda_10", 0, 0]]}, "inbound_nodes": [[["input", 0, 0, {}]]]}, {"name": "decoder", "class_name": "Model", "config": {"name": "decoder", "layers": [{"name": "decoder_input", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 2], "dtype": "float32", "sparse": false, "name": "decoder_input"}, "inbound_nodes": []}, {"name": "decoder_h", "class_name": "Dense", "config": {"name": "decoder_h", "trainable": true, "dtype": "float32", "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["decoder_input", 0, 0, {}]]]}, {"name": "flat_decoded", "class_name": "Dense", "config": {"name": "flat_decoded", "trainable": true, "dtype": "float32", "units": 784, "activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["decoder_h", 0, 0, {}]]]}], "input_layers": [["decoder_input", 0, 0]], "output_layers": [["flat_decoded", 0, 0]]}, "inbound_nodes": [[["encoder", 1, 2, {}]]]}], "input_layers": [["input", 0, 0]], "output_layers": [["decoder", 1, 0]]}, "keras_version": "2.3.1", "backend": "tensorflow"}